Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Alternatively, you can use Swift’s implicit bridging to pass a pointer to an instance or to the elements of an array.
ja: あるいはまた、あなたはSwiftの暗黙的ブリッジを使ってポインタをインスタンスへまたは配列の要素へと渡せます。

source: Although strings in Swift have value semantics, strings use a copy-on-write strategy to store their data in a buffer.
ja: Swiftにおける文字列は値意味論を持ちますが、文字列はコピーオンライト戦略を使ってそれらのデータをバッファに格納します。

source: Although the Swift overlay updates many Objective-C methods to return native Swift indices and index ranges, some still return instances of NSRange.
ja: Swiftオーバーレイが多くのObjective-Cメソッドを更新してSwift生来のインデックスおよびインデックス範囲を返すとはいえ、いくつかはまだNSRangeインスタンスを返します。

source: Always remember to deallocate any memory that you allocate yourself.
ja: あなたがあなた自身でアロケートするメモリは何であれデアロケートするのを必ず忘れないでください。

source: Always use the slice’s startIndex property instead of assuming that its indices start at a particular value.
ja: 常にスライスのstartIndexプロパティを使ってください、それのインデックスが特定の値で始まると決めてかかるのではなく。

source: Always zero, which is the index of the first byte in a nonempty buffer.
ja: 常にゼロ、それはある「空でない」バッファにおける最初のバイトのインデックスです。

source: An 8-bit signed integer value type.
ja: 8ビット符号つき整数値型。

source: An 8-bit unsigned integer value type.
ja: 8ビット符号なし整数値型。

source: An AutoreleasingUnsafeMutablePointer<Type> value.
ja: AutoreleasingUnsafeMutablePointer<Type>値。

source: An UnsafeBufferPointer instance is a view into memory and does not own the memory that it references.
ja: UnsafeBufferPointerインスタンスは、メモリに対するあるビューであり、それが参照するメモリ自体ではありません。

source: An UnsafeMutableBufferPointer instance is a view into memory and does not own the memory that it references.
ja: UnsafeMutableBufferPointerインスタンスは、メモリに対するある見方（ビュー）であり、それが参照するメモリ自体ではありません。

source: An UnsafeMutablePointer<Type> value.
ja: UnsafeMutablePointer<Type>値。

source: An UnsafeMutablePointer instance allocated with eight bytes of memory, uint8Pointer, will be used for the examples below.
ja: 8バイトのメモリデアロケートされるUnsafeMutablePointerインスタンス、uint8Pointerは、下の例で使われます。

source: An UnsafeMutableRawBufferPointer instance is a view into memory and does not own the memory that it references.
ja: UnsafeMutableRawBufferPointerインスタンスは、メモリに対するある見方（ビュー）であり、それが参照するメモリ自体ではありません。

source: An UnsafeMutableRawBufferPointer instance is a view of the raw bytes in a region of memory.
ja: UnsafeMutableRawBufferPointerインスタンスは、メモリのある領域の中の生のバイトのある見方（ビュー）です。

source: An UnsafePointer<Type>, UnsafeMutablePointer<Type>, or AutoreleasingUnsafeMutablePointer<Type> value, which is implicitly cast to UnsafePointer<Type> as necessary.
ja: UnsafePointer<Type>、UnsafeMutablePointer<Type>、またはAutoreleasingUnsafeMutablePointer<Type>値、それは暗黙的にUnsafePointer<Type>へと必要に応じてキャストされます。

source: An UnsafePointer instance allocated with eight bytes of memory, uint8Pointer, will be used for the examples below.
ja: 8バイトのメモリデアロケートされるUnsafePointerインスタンス、uint8Pointerは、下の例で使われます。

source: An UnsafeRawBufferPointer instance is a view into memory and does not own the memory that it references.
ja: UnsafeRawBufferPointerインスタンスは、メモリに対するある見方（ビュー）であり、それが参照するメモリ自体ではありません。

source: An UnsafeRawBufferPointer instance is a view of the raw bytes in a region of memory.
ja: UnsafeRawBufferPointerインスタンスは、メモリのある領域の中の生のバイトのある見方（ビュー）です。

source: An async function can also be a throwing function, which you call by prepending try await to the function call.
ja: async関数はまた、あるスロー関数であることが可能です、それはあなたがtry awaitをその関数呼び出しの前に付けることによって呼び出すものです。

source: An appendInterpolation method can also throw; when a user writes a literal with one of these interpolations, they must mark the string literal with try or one of its variants.
ja: appendInterpolationメソッドはまたスローできます；ユーザがあるリテラルをそれら補間の１つで書く場合、それらはその文字列リテラルをtryまたはそれの変種の１つで印しなければなりません。

source: An array containing the elements of this sequence in reverse order.
ja: このシーケンスの要素を逆順に含んでいる配列。

source: An array containing the transformed elements of this sequence.
ja: このシーケンスの変換済み要素を含んでいる配列。

source: An array of subsequences, split from this collection’s elements.
ja: このコレクションの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of subsequences, split from this sequence’s elements.
ja: このシーケンスの要素を分割した、下位シーケンスいくらかからなる配列。

source: An array of the elements that isIncluded allowed.
ja: isIncludedが許可する要素からなる配列。

source: An array of the non-nil results of calling transform with each element of the sequence.
ja: シーケンスの各要素でtransformを呼ぶことの非nilの結果の配列。

source: An array of this sequence’s elements in a shuffled order.
ja: このシーケンスの持つ要素からなる配列、シャッフルされた順番で。

source: An asynchronous sequence called RankCounter produces all elements of the array.
ja: RankCounterと呼ばれる非同期シーケンスは、その配列のすべての要素を取り出します。

source: An asynchronous sequence of the initial, consecutive elements that satisfy predicate.
ja: 冒頭の、predicateを満たす連続した要素それらからなるある非同期シーケンス。

source: An asynchronous sequence starting at the beginning of the base sequence with at most count elements.
ja: 基底シーケンスの先端で始まる多くともcount要素の非同期シーケンス。

source: An asynchronous sequence that contains, in order, the elements of the base sequence that satisfy the given predicate.
ja: ある非同期シーケンス、それは基底シーケンスの要素それらを、順番に含みます、それらは与えられた述部を満たすものです。

source: An asynchronous sequence that contains, in order, the elements produced by the transform closure.
ja: ある非同期シーケンス、それはtransformクロージャによって生み出された要素それらを、順番に含みます。

source: An asynchronous sequence that contains, in order, the non-nil elements produced by the transform closure.
ja: ある非同期シーケンス、それはtransformクロージャによって生み出された非nil要素それらを、順番に含みます。

source: An asynchronous sequence that drops the first count elements from the base sequence.
ja: ある非同期シーケンス、それは最初のcount要素を基底シーケンスから抜かします。

source: An asynchronous sequence that skips over values from the base sequence until the provided closure returns false.
ja: ある非同期シーケンス、それは基底シーケンスから値それらを、この提供されたクロージャがfalseを返すまで飛び越えるものです。

source: An element of a slice is located under the same index in the slice and in the base collection, as long as neither the collection nor the slice has been mutated since the slice was created.
ja: スライスの要素は、スライスにおいてそして基盤コレクションにおいて同じインデックス下に位置します、コレクションもスライスもスライスが作成されてから変化させられない限りは。

source: An element to search for in the collection.
ja: このコレクションにおいて捜される要素。

source: An enclosing combining mark.
ja: 囲み結合符号。

source: An encoding error was detected.
ja: エンコーディングエラーが検知された。

source: An enumeration of the elements of a sequence or collection.
ja: シーケンスまたはコレクションの要素の列挙。

source: An error that occurs during the decoding of a value.
ja: ある値のデコーディングの間に起こるエラー。

source: An error that occurs during the encoding of a value.
ja: ある値のエンコーディングの間に起こるエラー。

source: An error-throwing mapping closure.
ja: あるエラースローマッピングクロージャ。

source: An escaped textual representation of the Unicode scalar, suitable for debugging.
ja: ユニコードスカラーのエスケープされたテキスト表現、デバッグに適するもの。

source: An executor MAY utilize priority information to attempt running higher priority tasks first, and then continuing to serve lower priority tasks.
ja: エグゼキュータ（遂行者）は、優先度情報を活用して、より高い優先度のタスクを最初に実行する、そしてそれから引き続きより低い優先度のタスクのために働く「かもしれません」。

source: An extended-precision, floating-point value type.
ja: 拡張倍精度、浮動小数点値型。

source: An immutable pointer to the elements of an array is implicitly created when you pass the array as an argument.
ja: 配列の要素への不変ポインタは、あなたが配列を引数として渡す時に暗黙的に作成されます。

source: An implementation detail of key path expressions; do not use this protocol directly.
ja: キーパス式の実装詳細；このプロトコルを直接に使わないでください。

source: An in-out expression of type Type that contains a mutable variable, property, or subscript reference, which is passed as a pointer to the address of the mutable value.
ja: １つの可変変数、プロパティ、または添え字参照を含んでいる、型Typeのin-out式、それはその可変値のアドレスに対するポインタとして渡されます。

source: An in-out expression of type [Type] that contains a mutable variable, property, or subscript reference, which is passed as a pointer to the start of the array, and is lifetime-extended for the duration of the call.
ja: 可変の変数、プロパティ、または添え字参照を含んでいる、型[Type]のin-out式、それはその配列の始まりへのポインタとして渡されます、そして呼び出しの間は寿命延長されます。

source: An in-out expression that contains a mutable variable, property, or subscript reference of type Type, which is passed as a pointer to the address of the left-hand side identifier.
ja: 型Typeの可変変数、プロパティ、または添え字参照を含むインアウト式、それは左手側識別子のアドレスへのポインタとして渡されます。

source: An in-out expression that contains a mutable variable, property, or subscript reference of type Type.
ja: 型Typeの可変変数、プロパティ、または添え字参照を含むインアウト式。

source: An index offset by distance from the index i, unless that index would be beyond limit in the direction of movement.
ja: distanceだけインデックスiから補われたインデックス、そのインデックスがlimitを移動方向において越える場合を除きます。

source: An index offset by distance from the index i.
ja: distanceだけインデックスiから補われるインデックス。

source: An index offset by n from the index i, unless that index would be beyond limit in the direction of movement.
ja: インデックスiからnだけ補われたインデックス、そのインデックスがlimitを移動方向において越えない限りは。

source: An index offset by n from the index i.
ja: インデックスiからnだけ補われるインデックス。

source: An indication of a decoding error.
ja: デコードエラーのしるし。

source: An indication that no more Unicode scalars are available in the input.
ja: この入力の中にこれ以上利用可能なユニコードスカラーがないしるし。

source: An initial quotation mark.
ja: 最初の引用符。

source: An instance of Task always represents a top-level task.
ja: Taskのあるインスタンスは、常にトップレベルタスクを表します。

source: An instance of the AsyncIterator type used to produce elements of the asynchronous sequence.
ja: 非同期シーケンスの要素それらを生み出すために使われるAsyncIterator型のインスタンス。

source: An instance representing the state of the receiver with the difference applied, or nil if the difference is incompatible with the receiver’s state.
ja: 適用された差異をもつレシーバの状態を表しているインスタンス、またはnil、もし差異がレシーバのもつ状態と相容れないならば。

source: An integer to compare.
ja: 比較する整数。

source: An integer to convert to this type.
ja: この型へと変換する整数。

source: An integer type that can represent both positive and negative values.
ja: 正および負の値の両方を表すことができる整数型。

source: An integer type that can represent only nonnegative values.
ja: 非負値だけを表すことができる整数型。

source: An integer type that uses a fixed size for every instance.
ja: あらゆるインスタンスに対して固定された大きさを使う整数型。

source: An integer type with a binary representation.
ja: バイナリ表現での整数型。

source: An integer value.
ja: ある整数値。

source: An interval from a lower bound up to, and including, an upper bound.
ja: 下側の境界から、上側の境界までの、そしてそれを含む、間隔。

source: An iterator for Zip2Sequence.
ja: Zip2Sequenceのためのイテレータ。

source: An iterator for a StrideThrough instance.
ja: StrideThroughインスタンスのためのイテレータ。

source: An iterator for a StrideTo instance.
ja: StrideToインスタンスのためのイテレータ。

source: An iterator for the elements in the buffer referenced by an UnsafeBufferPointer or UnsafeMutableBufferPointer instance.
ja: UnsafeBufferPointerまたはUnsafeMutableBufferPointerによって参照されるバッファの中の要素のためのイテレータ。

source: An iterator of code units to be decoded.
ja: デコードされることになるいくらかのコード単位のイテレータ。

source: An iterator of code units to be translated, encoded as sourceEncoding.
ja: 翻訳されることになるいくらかのコード単位からなるあるイテレータ、sourceEncodingとしてエンコードされます。

source: An iterator over the bytes viewed by a raw buffer pointer.
ja: ある生のバッファポインタによるビューでのバイトすべてに対するイテレータ。

source: An iterator over the elements of this buffer.
ja: このバッファの要素すべてを対象としたイテレータ。

source: An iterator to any elements of source that didn’t fit in the buffer, and a typed buffer of the written elements.
ja: バッファに収まらないsourceの何らかの要素に対するイテレータ、そして書き出される要素の型付バッファ。

source: An iterator to any elements of source that didn’t fit in the buffer, and an index to the point in the buffer one past the last element written.
ja: sourceの何らかの要素で、バッファの中にぴったり合わないものに対するイテレータ、そして書かれた最後の要素を１つすぎたバッファの中の地点に対するインデックス。

source: An offset in UTF-16 code units.
ja: UTF-16コード単位におけるあるオフセット。

source: An offset in code units.
ja: コード単位でのオフセット。

source: An opaque C pointer.
ja: 不透明Cポインター。

source: An opaque pointer to the value of this unmanaged reference.
ja: この管理されない参照の値への不透明ポインタ。

source: An opening punctuation mark of a pair.
ja: ある対のある開き句読点符号。

source: An ordered, random-access collection.
ja: 順序付けられた、無作為アクセスのコレクション。

source: An output stream.
ja: ある出力ストリーム。

source: An overshift results in -1 for a negative value of lhs or 0 for a nonnegative value.
ja: オーバーシフトは、負の値のlhsに対して-1または非負値に対して0という結果になります。

source: An unkeyed decoding container view into self.
ja: selfへのキー無しデコーディングコンテナビュー。

source: An unmanaged class reference to value.
ja: valueへの管理されないクラス参照。

source: An unmanaged reference to the object passed as value.
ja: valueとして渡されるオブジェクトへの管理されない参照。

source: An unordered collection of unique elements.
ja: 特有な要素いくつかからなるある順番付けられないコレクション。

source: An unowned reference to a serial executor (a SerialExecutor value).
ja: ある直列遂行者（シリアルエグゼキュータ）への非所有参照（SerialExecutor値）。

source: An unsafe task handle for the current task.
ja: 現在のタスクに対する非安全タスクハンドラ。

source: An unsigned 64-bit random value.
ja: 符号なし64ビット無作為値。

source: An unsigned integer value type.
ja: 符号なし整数値型。

source: An unspecified result is supplied automatically by the Swift standard library.
ja: 未指定の結果はSwift標準ライブラリによって自動的に提供されます。

source: An uppercase copy of the string.
ja: この文字列の大文字でのコピー。

source: An uppercase letter.
ja: 大文字。

source: Another integer to compare.
ja: 比較するもう一方の整数。

source: Another integer value.
ja: もう１つの整数値。

source: Another range-replaceable collection.
ja: もう一方の範囲置換可能なコレクション。

source: Another string.
ja: 別の文字列。

source: Another valid index of the collection.
ja: コレクションの別の有効なインデックス。

source: Another value to compare.
ja: もう一方の比較する値。

source: Any String instance can be bridged to NSString using the type-cast operator (as), and any String instance that originates in Objective-C may use an NSString instance as its storage.
ja: 何らかのStringインスタンスは、NSStringへブリッジされることが型キャスト演算子（as）を使って行えます、そして何らかのStringインスタンスでObjective-C起源のものはNSStringインスタンスをそれのストレージとして使っても構いません。

source: Any fractional part of the value passed as source is removed, rounding the value toward zero.
ja: sourceとして渡される値の小数部分は何であれ取り除かれます、値はゼロへと丸められます。

source: Any fractional part of the value passed as source is removed.
ja: sourceとして渡される値の小数部分は何であれ取り除かれます。

source: Any memory in the region source..<(source + count) that does not overlap with the destination region is returned to an uninitialized state.
ja: 領域source..<(source + count)の中の何らかのメモリで行き先の領域と重ならないものは、未初期化状態に戻されます。

source: Any results, including errors thrown by tasks affected by this cancellation, are silently discarded.
ja: あらゆる結果は、この取り消しで影響を受けるタスクによってスローされるエラーを含めて、黙って廃棄されます。

source: Appending Strings and Characters
ja: 文字列と文字を追加する

source: Appends a literal segment to the interpolation.
ja: あるリテラル文節をその補間に加えます。

source: Appends the Unicode scalar values in the given sequence to the view.
ja: 与えられたシーケンスの中のユニコードスカラー値をビューに追加します。

source: Appends the characters in the given sequence to the string.
ja: 与えられたシーケンスの中の文字を文字列へ追加します。

source: Appends the elements of a sequence to a range-replaceable collection.
ja: あるシーケンスの要素を範囲置換コレクションに加えます。

source: Appends the given Unicode scalar to the view.
ja: 与えられたユニコードスカラーをビューに追加します。

source: Appends the given character to the string.
ja: 与えられた文字を文字列へ加えます。

source: Appends the given string to the stream.
ja: 与えられた文字列をストリームへ追加します。

source: Appends the given string to this string.
ja: 与えられた文字列をこの文字列へ加えます。

source: Apple platforms use arc4random_buf(3).
ja: Appleプラットホームは、arc4random_buf(3)を使います。

source: Applications that store identifiers in NFKC normalized form should instead use isXIDContinue to check whether a scalar is a valid identifier character.
ja: NFKC正規化形式で識別子を格納するアプリケーションは、代わりにisXIDContinueを使って、あるスカラーが有効な識別子文字であるかどうかを調べるべきです。

source: Applications that store identifiers in NFKC normalized form should instead use isXIDStart to check whether a scalar is a valid identifier character.
ja: NFKC正規化形式で識別子を格納するアプリケーションは、代わりにisXIDStartを使って、あるスカラーが有効な識別子文字であるかどうかを調べるべきです。

source: Applies the given difference to this collection.
ja: 与えられた差異をこのコレクションに適用します。

source: Apply macros to your Objective-C APIs to customize how they're imported into Swift.
ja: マクロをあなたのObjective-C APIに適用して、それらがSwiftにインポートされる方法をカスタマイズします。

source: Are you measuring the number of characters that will be displayed on the screen, or are you measuring the amount of storage needed for the string in a particular encoding?
ja: あなたが画面上に表示される文字の数を数えているのか、またはあなたはある特定の符号化での文字列に必要とされるストレージの量を測っているのか？。

source: Arrays and Dictionaries
ja: 配列と辞書

source: As a result, different representations of a string compare as being equal.
ja: 結果として、ある文字列の異なる表現は等しいと比較されます。

source: As a result, each view of the string "🇵🇷" reports a different length.
ja: 結果として、文字列"🇵🇷"の各ビューは異なる長さを報告します。

source: As an example, here’s an implementation of an output stream that converts any input to its plain ASCII representation before sending it to standard output.
ja: 一例として、ここに出力ストリームの実装があります、それは何らかの入力を標準出力に送る前にそれの標準ASCII表現に変換します。

source: As is typical in Swift, you can call the print(address:as:) function with an UnsafeMutableRawPointer instance.
ja: Swiftでは普通であるように、あなたはprint(address:as:)関数をUnsafeMutableRawPointerインスタンスとともに呼び出せます。

source: As is typical in Swift, you can call the print(address:as:) function with an UnsafeRawPointer instance.
ja: Swiftでは普通であるように、あなたはprint(address:as:)関数をUnsafeRawPointerインスタンスとともに呼び出せます。

source: As is typical in Swift, you can call the printInt(atAddress:) function with an UnsafeMutablePointer instance.
ja: Swiftでは普通であるように、あなたはprintInt(atAddress:)関数をUnsafeMutablePointerインスタンスとともに呼び出せます。

source: As is typical in Swift, you can call the printInt(atAddress:) function with an UnsafePointer instance.
ja: Swiftでは普通であるように、あなたはprintInt(atAddress:)関数をUnsafePointerインスタンスとともに呼び出せます。

source: As of Unicode 6.3, any new scalars that represent numbers but do not meet the requirements of decimal will have numeric type numeric, and programs can treat digit and numeric equivalently.
ja: Unicode 6.3現在、数を表すしかしdecimalの要件を満たさないいくらかの新しいスカラーが数値型numericを持ちます、そしてプログラムはdigitとnumericを等価に扱うことができます。

source: As soon as the sequence has run out of elements, all subsequent calls return nil.
ja: シーケンスが要素を使い果たすやいなや、全てのその後の呼び出しはnilを返します。

source: As such, this method isn’t necessarily a way to avoid resource starvation.
ja: そういうものとして、このメソッドは必ずしもリソース欠乏を防ぐ方法ではありません。

source: Assign
ja: 代入する

source: Assigning into a ranged subscript of an UnsafeMutableRawBufferPointer instance copies bytes into the memory.
ja: UnsafeMutableRawBufferPointerインスタンスの範囲指定された添え字に対してアサインすることは、それらバイトをメモリにコピーします。

source: Assigning to part of the buffer must be done using the assign(repeating:count:) method on the buffer’s baseAddress.
ja: バッファの一部に対するアサインは、assign(repeating:count:)メソッドをバッファのもつbaseAddress上で使って終わっていなければなりません。

source: Assigns every element in this buffer’s memory to a copy of the given value.
ja: このバッファのもつメモリの中の全ての要素をこの与えられた値のあるコピーに割り当てます。

source: Associated Types
ja: さまざまな関連型

source: Asynchronous Sequences
ja: 非同期シーケンス

source: At least one of the sequences must be finite.
ja: 少なくともシーケンスのうちの一方は有限でなければなりません。

source: At the start of the body of a withTaskGroup(of:returning:body:) call, the task group is always empty.
ja: withTaskGroup(of:returning:body:)呼び出しの本体の始まりでは、タスクグループは常に空です。

source: At the start of the body of a withThrowingTaskGroup(of:returning:body:) call, the task group is always empty.
ja: withThrowingTaskGroup(of:returning:body:)呼び出しの本体の始まりでは、タスクグループは常に空です。

source: Attempt to cancel the task.
ja: タスクの取り消しを試みます。

source: Attempting to access an element by using an index outside the bounds of the slice may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to access an element by using an index outside the bounds of the slice’s indices may result in a runtime error, even if that index is valid for the original collection.
ja: ある要素にスライスのもつインデックスの境界外のインデックスを使ってアクセスを試みることは、実行時エラーという結果になるでしょう、たとえそのインデックスが元々のコレクションに対して有効であるとしてもです。

source: Attempting to remove more elements than exist in the collection triggers a runtime error.
ja: コレクションの中に存在するより多くの要素の削除を試みることは実行時エラーの引き金となります。

source: Available when Base conforms to BidirectionalCollection and RangeReplaceableCollection.
ja: BaseがBidirectionalCollectionとRangeReplaceableCollectionに準拠する時に利用可能です。

source: Available when Base conforms to BidirectionalCollection.
ja: BaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Base conforms to ContiguousBytes.
ja: BaseがContiguousBytesに準拠する場合に利用可能です。

source: Available when Base conforms to DataProtocol.
ja: BaseがDataProtocolに準拠する場合に利用可能です。

source: Available when Base conforms to LazySequenceProtocol.
ja: BaseがLazySequenceProtocolに準拠する場合に利用可能です。

source: Available when Base conforms to MutableCollection.
ja: BaseがMutableCollectionに準拠する時に利用可能です。

source: Available when Base conforms to RangeReplaceableCollection.
ja: BaseがRangeReplaceableCollectionに準拠する時に利用可能です。

source: Available when Base.Element conforms to Comparable.
ja: Base.ElementがComparableに準拠する時に利用可能です。

source: Available when Base.Element conforms to Equatable and Base conforms to BidirectionalCollection.
ja: Base.ElementがEquatableに準拠するそしてBaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Base.Element conforms to Equatable.
ja: Base.ElementがEquatableに準拠する時に利用可能です。

source: Available when Base.Element conforms to Sequence and Base conforms to LazySequenceProtocol.
ja: Base.ElementがSequenceに準拠するそしてBaseがLazySequenceProtocolに準拠する時に利用可能です。

source: Available when Base.Element conforms to Sequence.
ja: Base.ElementがSequenceに準拠する時に利用可能です。

source: Available when Base.Element conforms to StringProtocol.
ja: Base.ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Base.Element is String and Base conforms to BidirectionalCollection.
ja: Base.ElementがStringであるそしてBaseがBidirectionalCollectionに準拠する時に利用可能です。

source: Available when Base.Index conforms to Strideable, Base.Indices is Range<Base.Index>, Base.Index.Stride is Int, and Base conforms to RandomAccessCollection.
ja: Base.IndexがStrideableに準拠する、Base.IndicesがRange<Base.Index>である、Base.Index.StrideがIntである、そしてBaseがRandomAccessCollectionに準拠する時に利用可能です。

source: Available when Base.Indices is DefaultIndices<Slice<Base>>.
ja: Base.IndicesがDefaultIndices<Slice<Base>>である時に利用可能です。

source: Available when ChildTaskResult conforms to Comparable.
ja: ChildTaskResultがComparableに準拠する時に利用可能です。

source: Available when ChildTaskResult conforms to Equatable.
ja: ChildTaskResultがEquatableに準拠する時に利用可能です。

source: Available when Element conforms to Comparable.
ja: ElementがComparableに準拠する時に利用可能です。

source: Available when Element conforms to Equatable.
ja: ElementがEquatableに準拠する時に利用可能です。

source: Available when Element conforms to Sequence.
ja: ElementがSequenceに準拠する時に利用可能です。

source: Available when Element conforms to StringProtocol.
ja: ElementがStringProtocolに準拠する時に利用可能です。

source: Available when Element is String.
ja: ElementがStringである時に利用可能です。

source: Available when Element is UInt8.
ja: ElementがUInt8である時に利用可能です。

source: Available when Failure is Error.
ja: FailureがErrorである時に利用可能です。

source: Available when Failure is Never.
ja: FailureがNeverである時に利用可能です。

source: Available when Pointee is MIDIEventList.
ja: PointeeがMIDIEventListである時に利用可能です。

source: Available when Pointee is MIDIEventPacket.
ja: PointeeがMIDIEventPacketである時に利用可能です。

source: Available when Pointee is MIDIPacket.
ja: PointeeがMIDIPacketである時に利用可能です。

source: Available when Pointee is MIDIPacketList.
ja: PointeeがMIDIPacketListである時に利用可能です。

source: Available when Self conforms to FixedWidthInteger.
ja: SelfがFixedWidthIntegerに準拠する時に利用可能です。

source: Available when Self conforms to _Pointer.
ja: Selfが_Pointerに準拠する時に利用可能です。

source: Available when Storage is SIMD16<Int16>.
ja: StorageがSIMD16<Int16>である時に利用可能です。

source: Available when Storage is SIMD16<Int32>.
ja: StorageがSIMD16<Int32>である時に利用可能です。

source: Available when Storage is SIMD16<Int64>.
ja: StorageがSIMD16<Int64>である時に利用可能です。

source: Available when Storage is SIMD16<Int8>.
ja: StorageがSIMD16<Int8>である時に利用可能です。

source: Available when Storage is SIMD16<Int>.
ja: StorageがSIMD16<Int>である時に利用可能です。
